# Data Wrangling and EDA with pandas
# Part 2: Working on the Titanic Dataset

In Part 1, we identified some data problems in three datasets. In this part of the lecture, we practice data wrangling by addressing the data problems within the Titanic dataset.
+ We might overly do it here just for the sake of practicing data wrangling :)

In [55]:
import numpy as np
import pandas as pd

pd.set_option('max_columns', 100)

df = pd.read_csv('titanic_train.csv')
df.head(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

## Remove columns or rows: `DataFrame.drop()`

We don't need column PassengerId. We can drop it as follows:

In [ ]:
df.drop(columns=['PassengerId'], inplace=True)
# By default, DataFrame operations does NOT chance the original data. It simply produces a new copy.
# If we want to change the original copy of data, we can use option inplace=True as shown above.
# Alternatively, we can also write:
#df = df.drop(columns=['PassengerId'])

In [11]:
df.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

#### Exercise: drop two columns, 'Cabin' and 'Ticket'

In [57]:
df = df.drop(columns=['Cabin','Ticket'])
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

Hint: to drop rows instead of columns, just change `columns=...` to `index=...`

## Change column names: `DataFrame.rename()`

Suppose we want to change column name 'Fare' to 'Price':

In [58]:
df.rename(columns={'Fare':'Price'}, inplace=True)

In [59]:
df.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Price,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C

Hint: If we want to rename a large number of columns, it might be more efficient to simply assign a new list of names to `df.columns`, i.e., `df.columns = ['column 0 name', 'column 1 name', ...]` .

In [16]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Price',
       'Embarked'],
      dtype='object')

In [60]:
#another method
df.columns=['Saved', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Price',
       'Embarked']
df.head()

,Saved,Pclass,Name,Sex,Age,SibSp,Parch,Price,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

## Transform a column

<p>Suppose that we want to replace the values of the column "Sex", as follows:</p>
<p>
<ul>
<li><i>'female'</i> --> 0
<li><i>'male'</i> --> 1
</ul>
</p>
<p>We will show four alternative solutions to perform this task.</p>

### Solution 1: Boolean selection

In [19]:
# Let's work on a copy, so that the original dataset can be later reused for trying other solutions.
df1 = df.copy()

Create a column 'Job1' through <i>df.loc</i>.

In [72]:
df1.loc[df1['Sex'] == 'female', 'Sex'] = 0

C:\Users\monas\anaconda3\lib\site-packages\pandas\core\indexing.py:1817: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

In [21]:
df1.head(3)

,Saved,Pclass,Name,Sex,Age,SibSp,Parch,Price,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,7.9250,S

#### Exercise: In above, we only transformed one possible value of 'Sex'. Please transform the other possible values below.

In [73]:
df1.loc[df1['Sex'] == 'male', 'Sex'] = 1

In [74]:
df1.head(3)

   Saved     Sex   Age  SibSp  Parch  Pclass    Price  Embarked_C  Embarked_Q
0      0    male  22.0      1      0       3   7.2500           0           0
1      1  female  38.0      1      0       1  71.2833           1           0
2      1  female  26.0      0      0       3   7.9250           0           0

### Solution 2: `Series.apply(function)`

Here, we will use <b>Series.apply(function)</b> on the column <i>Sex</i>. The **function** specifies how to transform *each value*.

In [24]:
df2 = df.copy()

def Sex2Num(Sex_String):
    if Sex_String == 'female':
        return 0
    elif Sex_String == 'male':
        return 1
    else:
        return Sex_String

In [25]:
df2['Sex'] = df2['Sex'].apply(Sex2Num)

In [26]:
df2.head(3)

,Saved,Pclass,Name,Sex,Age,SibSp,Parch,Price,Embarked
0,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,7.9250,S

Let us try Solution 2 on a more complicated example. Suppose that, in df2, we want to create a new column *Married* as follows:
+ If column Name contains 'Mrs.', set value 1 in column Married
+ If column Name contains 'Miss.', set value 0 in column Married
+ Otherwise, set value np.nan in column Married

In [27]:
def IsMarried(Name_String):
    if 'Mrs.' in Name_String:
        return 1
    elif 'Miss.' in Name_String:
        return 0
    else:
        return np.nan

In [28]:
df2['Married'] = df2['Name'].apply(IsMarried)

In [29]:
df2.head()

,Saved,Pclass,Name,Sex,Age,SibSp,Parch,Price,Embarked,Married
0,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,7.2500,S,NaN
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,71.2833,C,1.0
2,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,7.9250,S,0.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,53.1000,S,1.0
4,0,3,"Allen, Mr. William Henry",1,35.0,0,0,8.0500,S,NaN

### Solution 3: `Series.apply(lambda function)`

In [ ]:
def f(x):
    return x+1
f(3)

In [ ]:
lambda x : x+1

Instead of declaring a function as above, we can pass a lambda (a.k.a., anonymous) function to simplify coding.

In [36]:
df3 = df.copy()

In [42]:
df3['Married'] = df3['Name'].apply(lambda x: 1 if 'Mrs.' in x
                                   else 0 if 'Miss.' in x
                                   else np.nan)

*Tech Note:* `elif` cannot be used in in-line if statement. But we can always use `if ... else` recursively, as above.

In [43]:
df3.head(3)

,Saved,Pclass,Name,Sex,Age,SibSp,Parch,Price,Embarked,Married
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,NaN
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,0.0

#### Exercise: In df3, create a new column *Married* using `apply(lambda function)`

In [44]:
df3['Married'] = df3['Married'].apply(lambda x: 0 if x=='female' else 1 if x=='male' else x)

In [45]:
df3.head(3)

,Saved,Pclass,Name,Sex,Age,SibSp,Parch,Price,Embarked,Married
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,NaN
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,1.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,0.0

### Solution 4: Replace values throughout the whole table using `DataFrame.replace()`

This is a simple, very powerful, yet possibly dangerous solution as it works on the whole dataset -- if you are not careful, you may inadvertently change values in columns not under scrutiny.

In [76]:
df4 = df.copy()

In [77]:
df4.replace({'female':0,'male':1}, inplace=True)

In [78]:
df4.head(2)

   Saved  Sex   Age  SibSp  Parch  Pclass    Price  Embarked_C  Embarked_Q
0      0    1  22.0      1      0       3   7.2500           0           0
1      1    0  38.0      1      0       1  71.2833           1           0

Either of the above four solutions results in the same transformation of column *Sex*. Let's just use df4. And drop column *Name*.
+ While we were able to extract some info about marital status as in Solutions 2 and 3 above, the created column *Married* has too many missing values to be useful

In [79]:
df = df4
df.drop(columns='Name',inplace=True)
df.head(3)

KeyError: "['Name'] not found in axis"

## Create dummy columns: `pandas.get_dummies()`

`pandas.get_dummies()` allows us to convert a categorical variable with k possible values into k new binary variables called *dummy variables*. This conversion is also called *one-hot encoding* in computer science. Below, we convert column `Embarked` into dummies.
+ Note that dummy conversion is meaningful only if k is small. Otherwise, it creates too many new independent variables, each carrying only negligible amount of informatin.

In [61]:
df = pd.get_dummies(df, columns=['Embarked'])

In [51]:
df.head(10)

,Saved,Pclass,Sex,Age,SibSp,Parch,Price,Embarked_C,Embarked_Q,Embarked_S
0,0,3,1,22.0,1,0,7.2500,0,0,1
1,1,1,0,38.0,1,0,71.2833,1,0,0
2,1,3,0,26.0,0,0,7.9250,0,0,1
3,1,1,0,35.0,1,0,53.1000,0,0,1
4,0,3,1,35.0,0,0,8.0500,0,0,1
5,0,3,1,NaN,0,0,8.4583,0,1,0
6,0,1,1,54.0,0,0,51.8625,0,0,1
7,0,3,1,2.0,3,1,21.0750,0,0,1
8,1,3,0,27.0,0,2,11.1333,0,0,1
9,1,2,0,14.0,1,0,30.0708,1,0,0

**We then need to drop one of the created dummies to avoid the multicollinearity problem.** Let's drop the most frequent one, *Embarked_S*.

In [62]:
df.drop(columns='Embarked_S', inplace=True)

## Create a new calculated column

In solutions 2 and 3 above, we already showed how to create a new calculated column from an existing column: just use a new column name on the left side of the assignment operation. Next let's see how to combine multiple columns to create a new column.

### If simple calculation

Let's add a column `Relatives` that equals the sum of two existing columns: `SibSp` and `Parch`.

In [63]:
df['Relatives'] = df.SibSp+df.Parch

In [75]:
df.head(10)

   Saved     Sex   Age  SibSp  Parch  Pclass    Price  Embarked_C  Embarked_Q
0      0    male  22.0      1      0       3   7.2500           0           0
1      1  female  38.0      1      0       1  71.2833           1           0
2      1  female  26.0      0      0       3   7.9250           0           0
3      1  female  35.0      1      0       1  53.1000           0           0
4      0    male  35.0      0      0       3   8.0500           0           0
5      0    male   NaN      0      0       3   8.4583           0           1
6      0    male  54.0      0      0       1  51.8625           0           0
7      0    male   2.0      3      1       3  21.0750           0           0
8      1  female  27.0      0      2       3  11.1333           0           0
9      1  female  14.0      1      0       2  30.0708           1           0

### If complex calculation, use `DataFrame.apply()`

Similar to `Series.apply()`, except now it takes a whole row as input.

Let's add a new column called `YoungMale`, where the value is 1 if Sex==1 and Age<20, and 0 otherwise.

In [65]:
# option axis=1 ensures that the function is applied to each row
df['YoungMale']=df.apply(lambda x : 1 if x.Sex == 1 and x.Age<20 else 0, axis=1)

In [66]:
df.head(10)

,Saved,Pclass,Name,Sex,Age,SibSp,Parch,Price,Embarked_C,Embarked_Q,Relatives,YoungMale
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,0,0,1,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,1,0,1,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,0,0,0,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,0,0,1,0
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,0,0,0,0
5,0,3,"Moran, Mr. James",male,NaN,0,0,8.4583,0,1,0,0
6,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,51.8625,0,0,0,0
7,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,21.0750,0,0,4,0
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,11.1333,0,0,2,0
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,30.0708,1,0,1,0

We created the above two new columns just to show related pandas coding. They are not useful for the predictive analytics, thus let's remove them:

In [67]:
df.drop(columns=['Relatives','YoungMale'], inplace=True)

### Rearrange column order

Suppose we want to move column `Pclass` to after column `Parch`. We can do so in two ways.
+ Use `DataFrame.reindex(columns=[the columns in the order that you want])`
+ Or, use the following:

In [69]:
df = df[['Saved','Sex','Age','SibSp','Parch','Pclass','Price','Embarked_C','Embarked_Q']]
# hint: we can use df.columns.to_list() to first produce the old column order, then copy & edit

In [70]:
df.head()

   Saved     Sex   Age  SibSp  Parch  Pclass    Price  Embarked_C  Embarked_Q
0      0    male  22.0      1      0       3   7.2500           0           0
1      1  female  38.0      1      0       1  71.2833           1           0
2      1  female  26.0      0      0       3   7.9250           0           0
3      1  female  35.0      1      0       1  53.1000           0           0
4      0    male  35.0      0      0       3   8.0500           0           0

### Save the processed data into a new file

In [71]:
df.isna().sum() #missing values issue

Saved           0
Sex             0
Age           177
SibSp           0
Parch           0
Pclass          0
Price           0
Embarked_C      0
Embarked_Q      0
dtype: int64

In [ ]:
df.to_csv('titanic_train_processed.csv', index=False)

Note that we haven't addressed the missing data problem in column `Age` yet. We leave it to the next lecture, where we'll see whether the predictive model performance is affected by different strategies of imputation.